Tekla Open API Reference for Tekla Structures 2025
WeldMark.SeamVisibilityAttributes Constructor (Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Creates a new weld seam visibility attributes instance with the given attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SeamVisibilityAttributes(
	bool showPrefix,
	bool showSize,
	bool showType,
	bool showAngle,
	bool showContour,
	bool showFinish,
	bool showLength,
	bool showPitch,
	bool showEffectiveThroat,
	bool showRootOpening
)
Public Sub New (
	showPrefix As Boolean,
	showSize As Boolean,
	showType As Boolean,
	showAngle As Boolean,
	showContour As Boolean,
	showFinish As Boolean,
	showLength As Boolean,
	showPitch As Boolean,
	showEffectiveThroat As Boolean,
	showRootOpening As Boolean
)
Parameters
showPrefix
Type: System.Boolean
The seam prefix visibility to be used.
showSize
Type: System.Boolean
The seam size visibility to be used.
showType
Type: System.Boolean
The seam type visibility to be used.
showAngle
Type: System.Boolean
The seam angle visibility to be used.
showContour
Type: System.Boolean
The seam contour visibility to be used.
showFinish
Type: System.Boolean
The seam finish visibility to be used.
showLength
Type: System.Boolean
The seam length visibility to be used.
showPitch
Type: System.Boolean
The seam pitch visibility to be used.
showEffectiveThroat
Type: System.Boolean
The seam effective throat visibility to be used.
showRootOpening
Type: System.Boolean
The seam root opening visibility to be used.
See Also
Reference
WeldMark.SeamVisibilityAttributes Class
WeldMark.SeamVisibilityAttributes Overload
Tekla.Structures.Drawing Namespace